Revit 2024 API
BuiltInFailures.StructuralCustomConnectionFailures.StructuralCustomConnectionComponentsRelationship Property
 Cannot create custom connection due to relationships to external elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StructuralCustomConnectionComponentsRelationship { get; }
Visual Basic
Public Shared ReadOnly Property StructuralCustomConnectionComponentsRelationship As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StructuralCustomConnectionComponentsRelationship {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StructuralCustomConnectionFailures Class
Autodesk.Revit.DB Namespace